we will work on an interesting dataset
<a href="https://www.kaggle.com/kaggle/sf-salaries">SF Salaries dataset</a>

In [1]:
import pandas as pd

In [2]:
#read the csv file
sal = pd.read_csv('Salaries.csv')

In [33]:
#see the statistics of the dataset
sal.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [34]:
#display the first 5 entries
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [5]:
#check how many entries are there, the datatypes distribution and the memory ***148654 records are present in this dataset
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [39]:
#Number of distinct employee names in this dataset
sal['EmployeeName'].unique().shape

(110811,)

In [6]:
#check the datatype of sal
print(type(sal))

<class 'pandas.core.frame.DataFrame'>

In [8]:
#check the datatype of columnns in this dataframe
print(type(sal['JobTitle']))
print(type(sal['Id']))
print(type(sal['BasePay']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [11]:
#we can create a slice of required columns as a new dataframe
new_df = sal[['EmployeeName', 'JobTitle', 'TotalPay', 'Year']]

In [12]:
new_df.head()

,EmployeeName,JobTitle,TotalPay,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19,2011

In [13]:
#what is average base pay
sal['BasePay'].mean()

66325.44884050643

In [23]:
#what is the  highest amount of OvertimePay?
pay = sal['OvertimePay'].max()
print(f'The highest overtimepay is {pay}')

The highest overtimepay is 245131.88

In [ ]:
#Find highest base pay amount
print("The highest base pay is ${}".format(round(sal['BasePay'].max(), 2)))

In [19]:
#What is the job title of Joe Lopez ?
sal[sal['EmployeeName'] == 'Joe Lopez']['JobTitle']

148653    Counselor, Log Cabin Ranch
Name: JobTitle, dtype: object

In [18]:
#How much does JOSEPH DRISCOLL make (including benefits)? 
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [25]:
#select the details of employee with highest pay
sal[sal['TotalPay'] == sal['TotalPay'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [26]:
#select the details of employee with least pay
sal[sal['TotalPay'] == sal['TotalPay'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [29]:
#What are the top 7 most common jobs
sal['JobTitle'].value_counts().head(7)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Name: JobTitle, dtype: int64

In [32]:
#How many unique job titles are present in this dataset?
val = sal['JobTitle'].nunique()
print(f'{val} number of unique jobs are present')

2159 number of unique jobs are present

In [44]:
# Get list of categorical variables
s = (sal.dtypes == 'object')
print(type(s))
object_cols = list(s[s].index)

print("Categorical variables:")
print(object_cols)

<class 'pandas.core.series.Series'>
Categorical variables:
['EmployeeName', 'JobTitle', 'Agency']

In [46]:
sal['JobTitle'] = sal['JobTitle'].apply(str.upper)
sal['JobTitle'].value_counts()

TRANSIT OPERATOR                         9424
SPECIAL NURSE                            5791
REGISTERED NURSE                         4955
CUSTODIAN                                3214
FIREFIGHTER                              3153
                                         ...
LIEUTENANT (POLICE DEPARTMENT)              1
POWERHOUSE ELECTRICIAN SUPERVISOR II        1
TRAFFIC HEARING OFFICER                     1
IS TECHNICIAN - ASSISTANT                   1
PRINCIPAL INVESTIGATOR, TAX COLLECTOR       1
Name: JobTitle, Length: 1637, dtype: int64

In [55]:
#Rename the columns
sal.rename(columns = {'JobTitle': 'JOB-ROLE', 'EmployeeName': 'NAME'}, inplace=True)
sal.head()

,Id,NAME,JOB-ROLE,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [56]:
#What was the average (mean) BasePay of all employees per year? (2011-2014) 
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [57]:
#How many people have the word Chief in their job title? 
def check_chief(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [60]:
sum(sal['JOB-ROLE'].apply(lambda x: check_chief(x)))

627

In [62]:
#check for correlations
sal['title_len'] = sal['JOB-ROLE'].apply(len)

In [63]:
sal[['title_len','TotalPayBenefits']].corr() # No correlation.

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000